cask_args appdir: '/Applications'

tap 'Homebrew/bundle'
tap 'homebrew/services'
tap 'caskroom/homebrew-versions'

tap 'caskroom/cask'
cask 'firefox'
cask 'rubymine'
cask 'atom'
cask 'google-chrome'
cask 'dropbox'
cask 'iterm2'
cask 'virtualbox'
cask 'skype'
cask 'sourcetree'
cask 'taskpaper'
cask 'vlc'
# cask '1password'
# cask 'alfredapp'
# cask 'evernote'
# cask 'dash'
# cask 'deskset'
# cask 'cloudapp'
# cask 'datagrip'
# cask 'gpgtools'
# cask 'intellij-idea'
# cask 'kaleidoscope'
# cask 'kindle'
# cask 'screenhero'
# cask 'whatsapp'
# cask 'grammarly'
# cask 'gitup'
# cask 'moom'
# cask 'ngrok'
# cask 'pgadmin3'
# cask 'postgres'
# cask 'slack'
# cask 'twitter'
#
brew 'autojump'
brew 'git'
brew 'rcm'
brew 'gitup'
brew 'tmux'
# brew 'vagrant'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'erlang'
brew 'elixir'
brew 'go'
brew 'node-build'
brew 'nodeenv'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
# brew 'phantomjs'
# brew 'qt'
# brew 'mysql'
# brew 'postgresql'
# brew 'redis'
# brew 'sqlite'
brew 'cowsay'
brew 'htop'
brew 'hub'
brew 'pandoc'
brew 'lynx'
brew 'zip'
# brew 'mas'

#brew install grc coreutils spark
