cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'caskroom/homebrew-versions'

cask '1password'
cask 'alfredapp'
cask 'airmail'
cask 'evernote'
cask 'atom'
cask 'sublime'
cask 'dash'
cask 'deskset'
cask 'dropbox'
cask 'firefox'
cask 'cloudapp'
cask 'datagrip'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'intellij-idea'
cask 'iterm2'
cask 'kaleidoscope'
cask 'kindle'
cask 'screenhero'
cask 'skype'
cask 'virtualbox'
cask 'whatsapp'
cask 'grammarly'
cask 'gitup'
cask 'moom'
cask 'ngrok'
cask 'pgadmin3'
cask 'postgres'
cask 'slack'
cask 'sourcetree'
cask 'taskpaper'
cask 'twitter'
cask 'vlc'

brew 'autojump'
brew 'git'
brew 'rcm'
brew 'gitup'
brew 'tmux'
brew 'vagrant'
brew 'heroku-toolbelt'
brew 'httpie'
brew 'erlang'
brew 'elixir'
brew 'go'
brew 'node-build'
brew 'nodeenv'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'phantomjs'
brew 'qt'
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'sqlite'
brew 'cowsay'
brew 'htop'
brew 'hub'
brew 'pandoc'
brew 'lynx'
#brew install grc coreutils spark
