cask_args appdir: '/Applications'

tap 'Homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'd12frosted/emacs-plus'

tap 'caskroom/homebrew-versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'

tap 'thoughtbot/formulae'
tap 'caskroom/fonts'

cask 'alfred'
cask 'atom'
cask 'balsamiq-mockups'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'font-source-code-pro'
cask 'gitup'
cask 'google-chrome'
cask 'grammarly'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'livereload'
cask 'ngrok'
cask 'postgres'
cask 'postico'
cask 'rubymine'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'taskpaper'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'whatsapp'


brew 'ack'
brew 'antigen'
brew 'autojump'
brew 'automake'
brew 'awscli'
brew 'cowsay'
brew 'ctags'
brew 'elixir'
brew 'git'
brew 'git-extras'
brew 'gitup'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'lynx'
brew 'mas'
brew 'mysql'
brew 'node-build'
brew 'nodeenv'
brew 'npm'
brew 'openconnect'
brew 'pandoc'
brew 'pass'
brew 'phantomjs'
brew 'pkg-config'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'rcm'
brew 'redis'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'neovim'
brew 'vim'
brew 'pv'
brew 'emacs-plus', link: true
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'


mas '1Password', id: 443987910
mas 'CopyClip', id: 595191960
mas 'Kaleidoscope', id: 587512244
mas 'Keynote', id: 409183694
mas 'Marked 2', id: 890031187
mas 'Moom', id: 419330170
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Paw', id: 584653203
mas 'TaskPaper', id: 424281111
mas 'Xcode', id: 497799835
mas 'aText', id: 488566438
mas 'iA Writer', id: 775737590
